Show / Hide Table of Contents
Class BIMPluginHostingGrpc
Grpc Implementation of BIMPluginHosting
Inheritance
System.Object
BIMPluginHostingGrpc
Implements
IBIMPluginHosting
System.IDisposable
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaStatiCa.Plugin
Assembly: IdeaStatiCa.Plugin.dll
Syntax
public class BIMPluginHostingGrpc : IBIMPluginHosting, IDisposable
Constructors
Improve this Doc   View Source
BIMPluginHostingGrpc(IBIMPluginFactory, IPluginLogger, String)
Declaration
public BIMPluginHostingGrpc(IBIMPluginFactory factory, IPluginLogger logger = null, string eventName = "IdeaStatiCaBIMPluginEvent")
Parameters
 Type |  Name |  Description
 IBIMPluginFactory |  factory
 IPluginLogger |  logger
 System.String |  eventName
Properties
Improve this Doc   View Source
EventName
System event name.
Declaration
public string EventName { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
GrpcPort
Port for Grpc communication.
Declaration
public int GrpcPort { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
Service
BIM Service.
Declaration
public IApplicationBIM Service { get; }
Property Value
 Type |  Description
 IApplicationBIM
Methods
Improve this Doc   View Source
Dispose()
Declaration
public void Dispose()
Improve this Doc   View Source
Dispose(Boolean)
Disposes current plugin host.
Declaration
protected virtual void Dispose(bool disposing)
Parameters
 Type |  Name |  Description
 System.Boolean |  disposing
Improve this Doc   View Source
RunAsync(String, String)
Declaration
public Task RunAsync(string id, string workingDirectory)
Parameters
 Type |  Name |  Description
 System.String |  id
 System.String |  workingDirectory
Returns
 Type |  Description
 System.Threading.Tasks.Task
Improve this Doc   View Source
Stop()
Stops the plugin host.
Declaration
public void Stop()
Events
Improve this Doc   View Source
AppStatusChanged
Triggered when app status changes.
Declaration
public event ISEventHandler AppStatusChanged
Event Type
 Type |  Description
 ISEventHandler
Implements
 IBIMPluginHosting
 System.IDisposable
 Improve this Doc
 View Source